Revit 2024 API
FabricWireItem Methods
The FabricWireItem type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a single Fabric wire.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace